openAUTOSAR/classic-platform/arch/ppc/mpc55xx/drivers/Fls.c
	// Always check if status is not busy
	if (Fls_Global.status == MEMIF_BUSY)
		return E_NOT_OK;

	Fls_Global.status = MEMIF_BUSY;
	Fls_Global.jobResultType = MEMIF_JOB_PENDING;
	Fls_Global.jobType = FLS_JOB_READ;

	/** @req FLS237 */
	Fls_Global.flashAddr = SourceAddress;
	Fls_Global.ramAddr = TargetAddressPtr;
	Fls_Global.length = Length;
	Fls_Global.readChunkSize = FLS_MAX_READ_NORMAL_MODE;

	return E_OK;
}

#if ( FLS_COMPARE_API == STD_ON )
Std_ReturnType Fls_Compare( Fls_AddressType SourceAddress,
							uint8 *TargetAddressPtr,
							Fls_LengthType Length )
{
	SourceAddress += FLS_BASE_ADDRESS;
    /** @req FLS257 */
    /** @req FLS241 */
    /** @req FLS186 */

    /** @req FLS152 */
    VALIDATE_W_RV(Fls_Global.status != MEMIF_UNINIT,FLS_COMPARE_ID, FLS_E_UNINIT,E_NOT_OK );
    /** @req FLS153 */
    VALIDATE_W_RV( Fls_Global.status != MEMIF_BUSY, FLS_COMPARE_ID, FLS_E_BUSY, E_NOT_OK );
    /** @req FLS273 */
    VALIDATE_W_RV( TargetAddressPtr != NULL , FLS_COMPARE_ID, FLS_E_PARAM_DATA, E_NOT_OK );
	/** @req FLS150  */
	VALIDATE_W_RV( E_OK == fls_CheckValidAddress(SourceAddress), FLS_COMPARE_ID, FLS_E_PARAM_ADDRESS, E_NOT_OK );
	/** @req FLS151  */
	VALIDATE_W_RV( (Length != 0) && (E_OK == fls_CheckValidAddress(SourceAddress + Length)),
			FLS_COMPARE_ID, FLS_E_PARAM_LENGTH, E_NOT_OK );


	// Always check if status is not busy
	if (Fls_Global.status == MEMIF_BUSY )
	    return E_NOT_OK;

	Fls_Global.status = MEMIF_BUSY;
	Fls_Global.jobResultType = MEMIF_JOB_PENDING;
	Fls_Global.jobType = FLS_JOB_COMPARE;
	/* @req FLS242 */
	Fls_Global.flashAddr = SourceAddress;
	Fls_Global.ramAddr = TargetAddressPtr;
	Fls_Global.length = Length;

	return E_OK;
}
#endif

#if ( FLS_SET_MODE_API == STD_ON )
void Fls_SetMode( MemIf_ModeType Mode )
{
    /** !req FLS258 */
    /** !req FLS155 */
    /** !req FLS187 */

    /* API NOT SUPPORTED */
}
#endif

#if ( FLS_VERSION_INFO_API == STD_ON )
void Fls_GetVersionInfo( Std_VersionInfoType *VersioninfoPtr )
{
    /** @req FLS259 */
    /** @req FLS165 */
    /** @req FLS166 */
    /** !req FLS166 Change if moved to macro */

	memcpy(VersioninfoPtr, &_Fls_VersionInfo, sizeof(Std_VersionInfoType));
}
#endif

#if 0
void Fls_Check(uint32 flsBaseAddress, uint32 flsTotalSize) {
	// ECC checking is always on by default.
	// If a non correctable error is discovered
	// we will get an IVOR2 exception.

	// Enable Flash Non_Correctible Reporting,
	// Not really necessary but makes more information
	// available in the MCM registers if an error occurs.
#if defined(CFG_MPC560X) || defined(CFG_MPC5567) || defined(CFG_MPC563XM)
	ECSM.ECR.B.EFNCR = 1;
#elif defined (CFG_MPC5516)
	MCM.ECR.B.EFNCR = 1;
#else
#warning "Non supported processor"
#endif

	// Read flash in 32bit chunks, it's most efficient.
	uint32* memoryChunkPtr = (uint32*) flsBaseAddress;
	uint32* flsTotalSizePtr = (uint32*) flsTotalSize;
	uint32 memoryChunk = *memoryChunkPtr; // The first read

	// Read the rest of the flash, chunk by chunk
	while (memoryChunkPtr < flsTotalSizePtr) {
		memoryChunk = *(memoryChunkPtr++);
	}
}
#endif

